Repository: babyboss01946566334/social-poster-app
Catalog: lib/l10n/app_*.arb
Languages: bn

# appTitle
source: Social Scheduler
bn: সোশ্যাল শিডিউলার

# emailLabel
source: Email
bn: ইমেইল

# passwordLabel
source: Password
bn: পাসওয়ার্ড

# invalidEmailError
source: Please enter a valid email
bn: সঠিক ইমেইল লিখুন

# passwordLengthError
source: Password must be at least 6 characters
bn: পাসওয়ার্ড ন্যূনতম ৬ অক্ষরের হতে হবে

# loginButton
source: Login
bn: লগইন করুন

# createAccountButton
source: Create a new account
bn: নতুন অ্যাকাউন্ট তৈরি করুন

# dashboardTitle
source: Dashboard
bn: ড্যাশবোর্ড

# logoutButton
source: Logout
bn: লগআউট

# noScheduledPosts
source: No scheduled posts found
bn: কোন শিডিউলড পোস্ট নেই

# statusScheduled
source: Scheduled
bn: শিডিউলড

# statusPosted
source: Posted
bn: পোস্ট হয়েছে

# statusFailed
source: Failed
bn: ব্যর্থ

# deleteFailedError
source: Error deleting post
bn: ডিলিট করতে সমস্যা হয়েছে

# postScheduledSuccess
source: Post scheduled successfully!
bn: পোস্ট সফলভাবে শিডিউল হয়েছে!

# scheduleError
source: Error scheduling post
bn: শিডিউল করতে সমস্যা হয়েছে

# newPostTitle
source: New Post
bn: নতুন পোস্ট

# postContentHint
source: Write your post here...
bn: আপনার পোস্ট এখানে লিখুন...

# scheduleTimeLabel
source: Schedule Time
bn: শিডিউল করার সময়

# scheduleButton
source: Schedule Post
bn: শিডিউল করুন

# postContentEmptyError
source: Post content cannot be empty
bn: পোস্টের কন্টেন্ট লিখুন

# error_invalid_email
source: The email format is incorrect.
bn: ভুল ইমেইল ফরম্যাট।

# error_user_disabled
source: This account has been disabled.
bn: অ্যাকাউন্টটি নিষ্ক্রিয় করা হয়েছে।

# error_user_not_found
source: Account not found.
bn: অ্যাকাউন্ট খুঁজে পাওয়া যায়নি।

# error_wrong_password
source: Wrong password.
bn: ভুল পাসওয়ার্ড।

# error_email_already_in_use
source: This email is already in use.
bn: এই ইমেইল ইতিমধ্যে ব্যবহৃত হয়েছে।

# error_weak_password
source: Password is too weak (minimum 6 characters).
bn: পাসওয়ার্ড দুর্বল (ন্যূনতম ৬ অক্ষর)।

# error_unknown
source: An unknown error occurred: {errorCode}
bn: একটি অজানা ত্রুটি ঘটেছে: {errorCode}
